app/controllers/todos_controller.rb

SELECT `todos`.* FROM `todos`
---
  def list
    @todo_list = Todo.all