app/controllers/todos_controller.rb

  def todo_app

    @todo_list = Todo.all
---
SELECT `todos`.* FROM `todos` ORDER BY `todos`.`id` ASC

  def delete
   @del = Todo.find(params[:id])
   if @del.destroy
    @todo_list=Todo.all
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 3 LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 3
SELECT `todos`.* FROM `todos` ORDER BY `todos`.`id` ASC

  def create
    todo = Todo.new( todo_params )
    if  todo.save
    @todo_list = Todo.all
---
INSERT INTO `todos` (`task`, `date`, `status`, `created_at`, `updated_at`) VALUES ('Talk to Venkat', '2022-06-11', TRUE, '2022-06-27 07:17:31.267547', '2022-06-27 07:17:31.267547')
SELECT `todos`.* FROM `todos` ORDER BY `todos`.`id` ASC

  def update
    id = params[:id]
    todo=Todo.find(id)
    todo.status = true
    if todo.save
    @todo_list = Todo.all
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 53 LIMIT 1
UPDATE `todos` SET `todos`.`status` = TRUE, `todos`.`updated_at` = '2022-06-27 10:15:03.562632' WHERE `todos`.`id` = 53
SELECT `todos`.* FROM `todos`